function horoscope(month,id) {
    var horoscope = {
            1: {

                "": "",
                "": "",
                "": "",
            },
            2: {

                "": "",
                "": "",
                "": "",
            },
            3: {

                "": "",
                "": "",
                "": "",
            },
            4: {

                "": "",
                "": "",
                "": "",
            },
            5: {

                "": "",
                "": "",
                "": "",
            },
            6: {

                "": "",
                "": "",
                "": "",
            },
            7: {

                "": "",
                "": "",
                "": "",
            },
            8: {

                "": "",
                "": "",
                "": "",
            },
            9: {

                "": "",
                "": "",
                "": "",
            },
            10: {

                "": "",
                "": "",
                "": "",
            },
            11: {

                "Львы": "паип",
                "": "",
                "": "",
            },

            12: {
                "Львы": "Хороший период также будет у Львов. В первой половине месяца у них может просто взыграть эмоциональная жизнь: успех в любви, фонтан эмоций, счастье, притяжение к любимой (или любимому), возможность выиграть лотерею. На ловца и зверь бежит – это будет про Львов в декабре: нужные люди и события сами будут притягиваться в их жизнь. Помимо прочего, для Львов в декабре будет подходящее время, чтобы забеременеть, завести ребенка. Любовь, секс, отношения – в этом Львам будет везти. В общем, благостное время ждет Львов, им будет катастрофически везти. Я даже не вижу как-то особых проблем или чего-то такого в декабре, чего бы они не сумели преодолеть.",

                "Водолеи": "Наибольший успех в декабре ждет Водолеев. В этом месяце они найдут много новых покровителей, меценатов, а также друзей. Во второй половине декабря перед ними откроются прекрасные возможности в самых разных сферах. В Водолеев начнут вкладывать деньги, в них поверят. Они смело могут финансово рисковать. Особенно во второй половине месяца их ждет безусловный финансовый успех в каком-то новом проекте, в каком-то таком деле, которым Водолеи еще не занимались до того. Их также может крайне удачный переход в другую компанию, причем совершенно неожиданным образом. Водолеям в декабре либо предложат намного бо́льшие деньги на новом месте, либо на старом им повысят зарплату.",
                "Тельцы": "Хороший период в декабре также ждет представителей этого знака. Особенно удачными будут инвестиции, страхование имущества, а еще неожиданно они могут получить наследство. Также у Тельцов в декабре будет защита от трудных и неприятных ситуаций в дальних дорогах, поэтому они могут спокойно путешествовать. Да и в целом у них весьма благоприятная ситуация в последнем месяце года.",

                "Скорпионы": "Скорпионов ждет очень хорошая ситуация, особенно в финансовом плане. И продлится она весь месяц. Скорпионы в фаворе, их ждет успех, динамика. Они смело могут рисковать, вкладывать во что-то деньги. В частности, они могут рассчитывать на успех в делах, связанных с недвижимостью. Семейные дела также будут складываться хорошо и благостно. Единственное неприятное, что у Скорпионов может быть в декабре – это разоблачение измен: если им изменят супруг (или супруга), как раз в декабре они могут об этом узнать.",

                "Раки": "Негативный период в декабре ждет Раков. Им следует быть готовыми к сложным ситуациям, противостоянию с партнерами, с которыми они могут разругаться, особенно в первой половине месяца. Трудности в контактах и непонимание во взаимоотношениях – к этому тоже Ракам надо быть готовыми. На них даже могут подать в суд или понизить в должности. Все в их жизни в этот период будет происходить как-то не так.. Ракам однозначно не стоит в это время менять работу, да и вообще что-то менять в своей жизни кардинальным образом – лучше пересидеть и переждать это время.",

                "Овны": "У Овнов возможны неприятные истории в дорогах, сложности в поездках – велика угроза ДТП и опасных ситуаций. Потому представителям этого знака, если они до сих пор этого не сделали, надо срочно поменять летние шины на зимние, а еще лучше – просто стараться не выезжать в эти дни. В их жизни также возможны неожиданные ситуации, связанные с предательствами и разочарованиями.",

                "Весы": "Представители этого знака также являются одними из главных неудачников месяца: их могут обворовать, обмануть, их квартиру могут посетить домушники, у них могут угнать автомобиль… Весам лучше не доверять кому-то свои финансовые проекты. Доверяй, но проверяй – это должен быть просто лозунг у Весов в декабре. Также им лучше не вкладывать деньги в непроверенные имущественные проекты. Время, когда им стоит просто отдыхать и поменьше активничать.",

                "Козероги": "Козерогов также ждет сложный период в декабре. Весь месяц для них будет непростой. В это время у них ощутимо расширится зона неприятелей. Козероги будут пытаться очень многое сделать в декабре, но не успеют этого. У них словно будет сжиматься какая-то пружина, и все будет как-то сложно. Самая главная угроза для них в декабре – риск потерять самых близких людей (может уйти от них жена (или муж), или любовница может сказать до свидания). Также их ждут сложные ситуации с родственниками. Это худшее время для приобретения недвижимости или смены места жительства.",

                "Стрельцы": "Для Стрельцов не очень благоприятной будет первая половина месяца, но прекрасной будет вторая, когда их будет ждать успех, счастье, большие возможности. Они смогут прокрутить очень много денег, особенно в 20-х числах. Но первые десять дней месяца будут очень сложными, с разного рода неожиданными поворотами, расставаниями, когда будет казаться, что все безрадостно и сложно.",

                "Близнецы": "Близнецов также ждут то взлеты, то падения. Они сумеют наладить жизнь во второй половине месяца, когда их будет ждать успех в партнерстве, контактах. Близнецы могут найти вторую половину или судьбу, особенно под новый год. Ну, или найти любовницу… Этот период будет периодом страсти, любви и отношений. Во второй половине месяца им можно менять работу, род занятий, хорошо будет идти торговля и взаимодействие с обществом. Однако в первой половине месяца возможны проблемы со здоровьем, особенно это касается переломов конечностей – нужно быть осторожными на льду.",

                "Рыбы.": "В декабре Рыбы могут ощущать над собой насилие, они могут просто притягивать насильников к себе. Сейчас Марс идет по зодиакальному знаку Рыб. Потому у представителей этого знака могут быть сложные ситуации, связанные с вымогательством, наездами, рейдерством. Особенно – первая половина месяца. А вот вторая половина декабря будет более благоприятной, и Рыбы выйдут из сложной ситуации, которая будет сохраняться в первой половине декабря. Для них вторая половина месяца будет хорошим временем, чтобы на время укрыться от всех, уехать куда-то за границу и отдохнуть.",

                "Девы": "Начало месяца у Дев будет благоприятным, особенно это касается дел, связанных с недвижимостью – именно в этой сфере их будет ждать успех. Во второй половине месяца они могут оказаться в неожиданно трудных ситуациях, связанных с начальством и работой. Возможны сложные ситуации в плане расписания, деятельности: они могут не все успеть, что планировали, могут не охватить тот участок работы, который бы им хотелось сделать. Из-за этого могут быть непростые ситуации с вышестоящими и руководством. Это однозначно не лучшее время для Дев, чтобы выпячивать свое эго."
            }

        },
        starSign = "";
    starSign = horoscope[month][id];
    return starSign;
}

var month = new Date();
console.log("Month:", month.getMonth()+1);
var nowMonth = month.getMonth()+1;

console.log(horoscope(nowMonth,"Львы"));